---
title: CADLinkType
classe: Autodesk.Revit.DB.CADLinkType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# CADLinkType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `LinkLoadResult LoadFrom(ExternalResourceReference)` | `cADLinkType.LoadFrom(resourceReference)` | LinkLoadResult |
| `LinkLoadResult LoadFrom(String)` | `cADLinkType.LoadFrom(path)` | LinkLoadResult |
| `LinkLoadResult Reload(CADLinkOptions)` | `cADLinkType.Reload(options)` | LinkLoadResult |
| `LinkLoadResult Reload()` | `cADLinkType.Reload()` | LinkLoadResult |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```